using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Zadanie1
{
    ///Фабрика:
    /// 1. Для создания и спавна врагов, предметов, систем связанных абстракцией
    /// 2. Создания поведения для обьектов
    ///
    /// Визитер:
    /// 1. Создание обьектов в фабрике
    /// 2. Создание дополнительных фич для сущностей: начисление очков за убийство, оповещение о спавне того или иного обьекта
    ///
    /// Декоратор:
    /// 1. Создание систем бонусов
    /// 2. Создание элементов экипировки
}
